//*****************************************************************************
// ファイル名       BuzzerControl.c
// 対象マイコン     RP2040
// ファイル内容     ブザー制御
//*****************************************************************************
//=============================================================================
//include
//=============================================================================
#include "pico/stdlib.h"
#include "pico/float.h"
#include "hardware/gpio.h"
#include "hardware/pwm.h"
#include "BuzzerControl.h"

//=============================================================================
//グローバル変数の宣言
//=============================================================================
unsigned long   beep_timer;     // ブザー用タイマ
unsigned int    beep_pattern;   // ブザーパターン
int             beep_mode;      // ブザーの処理状態
uint            slice_num_gpio21;

//*****************************************************************************
// PWMの初期化
//*****************************************************************************
void init_pwm(void) {
    gpio_set_function(21, GPIO_FUNC_PWM);
    slice_num_gpio21 = pwm_gpio_to_slice_num(21);
    pwm_set_output_polarity(slice_num_gpio21, PWM_CHAN_B, true);
    pwm_set_wrap(slice_num_gpio21, 31249);  // 4kHz
    pwm_set_chan_level(slice_num_gpio21, PWM_CHAN_B, 0);
    pwm_set_enabled(slice_num_gpio21, true);
}

//*****************************************************************************
// ブザー関連初期化
//*****************************************************************************
void init_beep(void) {
    init_pwm();
    beep_timer = 0;
    beep_pattern = 0x0000;
    beep_mode = 0;
    beep_out(0);
}

//*****************************************************************************
// ブザー音出力
//*****************************************************************************
void beep_out(int f) {
    if (f) {
        pwm_set_chan_level(slice_num_gpio21, PWM_CHAN_B, 15625);
    } else {
        pwm_set_chan_level(slice_num_gpio21, PWM_CHAN_B, 0);
    }
}

//*****************************************************************************
// ブザー音出力パターン設定
//*****************************************************************************
void set_beep_pattern(unsigned int data) {
    if (!beep_mode) {
        beep_pattern = data;
        beep_timer = 0;
        beep_mode = 1;
    }
}

//*****************************************************************************
// ブザー制御 (タイマ割り込みで1ms間隔で実行)
//*****************************************************************************
void beep_process(void) {
    if (beep_mode == 1) {
        if (beep_timer % 50 == 0) {
            if (beep_pattern & 0x8) {
                beep_out(1);
            } else {
                beep_out(0);
            }
            beep_pattern <<= 1;
        }
        beep_timer++;
        if (beep_timer / 50 == 5) {
            beep_out(0);
            beep_mode = 0;
        }
    }
}

//*****************************************************************************
// 終わり
//*****************************************************************************