//*****************************************************************************
// ファイル名       LcdControl.h
// 対象マイコン     RP2040
// ファイル内容     LCD制御用ライブラリ
//*****************************************************************************
#ifndef LCDCONTROL_H_
#define LCDCONTROL_H_

//=============================================================================
//シンボル定義
//=============================================================================
// ポート、ビット配置
#define LCD_DDR_NOLCD       (0x01 << 7) // LCDに関係ない1bitの位置
#define LCD_DDR_NOLCD_DDR   0           // INなら0、OUTなら1
#define LCD_BIT_BUSY        (0x01 << 3) // busy bit (D3のbit)
#define LCD_BIT_E           (0x01 << 6) // E bit
#define LCD_BIT_RW          (0x01 << 5) // RW bit
#define LCD_BIT_RS          (0x01 << 4) // RS bit

/*
ビット配列：    7　　　  6   5   4   3   2   1   0
         　　　未使用     E   RW  RS  D7  D6  D5  D4
*/

// LCD関連変数
#define LCD_MAX_X           16          // 表示文字数 横 16 or 20
#define LCD_MAX_Y           2           // 表示文字数 縦  2 or  4

// LCD制御コード
#define LCD_INST            0x00        // インストラクション
#define LCD_DATA            LCD_BIT_RS  // データ

//=============================================================================
//プロトタイプ宣言
//=============================================================================
int  lcd_init(void);
void lcd_process(void);
int  lcd_printf(char *format, ...);
void lcd_position(char x, char y);

#endif
//*****************************************************************************
// 終わり
//*****************************************************************************
